/* Переменные по TypeScript */
var a = 'Николай'; // -> строка
var b = 32; // -> число
var c = true; // -> логический
var g = undefined; // -> не определено (по умолжанию к любому типу данных)
g = null; // -> присваевается к любому типу данных
var s = null; // -> ничего (по умолжанию подходит к любому типу данных)
s = undefined; // -> присваевается к любому типу данных
var array = ['Привет', 'Мир']; // -> массив строкового типа
var array2 = [10, 2.5]; // -> массив числового типа
console.log(array);
console.log(array2);
//# sourceMappingURL=lesson2.js.map